content/posts/linux/linux-install-application/.linux-install-application.org
#+STARTUP: content
#+OPTIONS: \n:t
#+TITLE:	My Install Application in Linux
#+EXPORT_FILE_NAME: linux-install-application
#+AUTHOR:	Shawn Dennis Lin
#+EMAIL:	ShawnDennisLin@gmail.com
#+DATE:	[2021-03-16 Tue]

#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

#+SEQ_TODO: TODO DRAFT DONE
#+PROPERTY: header-args :eval no

#+HUGO_BASE_DIR: ~/shdennlin.github.io
#+HUGO_SECTION: /posts/linux/linux-install-application/

#+hugo_menu: :menu sidebar :name Linux Install Application :identifier linux-install-app :parent linux :weight auto
#+HUGO_CATEGORIES: OS
#+HUGO_TAGS: linux
#+HUGO_DRAFT: false
#+hugo_custom_front_matter: :hero /posts/linux/linux-install-application/images/linux.png

These are the applications I installed in Linux. If you have any questions about these apps, you can contact me.

#+HUGO: more

* My Install Application in Linux
** ag
A code searching tool similar to ack, with a focus on speed.
#+BEGIN_SRC shell
sudo apt-get install -y silversearcher-ag
#+END_SRC
+ GitHub: https://github.com/ggreer/the_silver_searcher
 
<2021-03-16 Tue>
  
** Anaconda
#+BEGIN_SRC shell
cd ~/Downloads
wget https://repo.anaconda.com/archive/Anaconda3-2020.02-Linux-x86_64.sh
bash ~/Dwonloads/Anaconda3-2020.02-Linux-x86_64.sh
conda create -n tf-gpu tensorflow-gpu
conda activate tf-gpu
#+END_SRC

** Angry IP scanner
Angry IP Scanner - fast and friendly network scanner 
*Go to Download Page to Download =deb= file* and type below:
#+begin_src shell
cd ~/Downloads
sudo apt install ipscan_3.7.6_all.deb # your version
#+end_src

+ Official Website: https://angryip.org/about/
+ Download Page: https://angryip.org/download/#linux
+ GitHub: [[https://github.com/angryip/ipscan/tree/3.7.2]]

<2021-03-19 Fri>

** BingWall - Bing wallpaper of the day
Bing wallpaper of the day application for Gnome desktop.
#+BEGIN_SRC shell
sudo snap install bing-wall
#+END_SRC
+ Snapcraft: https://snapcraft.io/bing-wall
+ GitHub: https://github.com/keshavbhatt/BingWall

<2021-03-16 Tue>

** boot-repair
#+BEGIN_SRC shell
sudo add-apt-repository ppa:yannubuntu/boot-repair &&\
sudo apt-get update &&\
sudo apt-get install -y boot-repair && boot-repair
#+END_SRC
+ Ref: https://help.ubuntu.com/community/Boot-Repair

<2021-03-19 Fri>

** bpytop
Resource monitor that shows usage and stats for processor, memory, disks, network and processes. Python port of bashtop.
#+BEGIN_SRC shell
cd ~/Downloads &&\
git clone https://github.com/aristocratos/bpytop.git &&\
cd bpytop &&\
sudo make install
#+END_SRC
+ GitHub: https://github.com/aristocratos/bpytop

<2021-03-19 Fri>

** 中文 Language pack
#+begin_src shell
echo $LANG

sudo apt-get install -y language-pack-zh-han* &&\
sudo apt install $(check-language-support)

sudo apt-get install language-pack-gnome-zh-han*
#+end_src
+ Ref: [[https://www.twblogs.net/a/5c38452dbd9eee35b21d8750][Ubuntu 18.04 LTS 命令行方式安裝中文語言包]]

<2021-03-19 Fri>

** Crow Translate
A small translate tool like QTranslate.
#+BEGIN_SRC shell
sudo add-apt-repository ppa:jonmagon/crow-translate &&\
sudo apt update &&\
sudo apt install crow-translate
#+END_SRC
+ Official Website: https://crow-translate.github.io/
+ GitHub: https://github.com/crow-translate/crow-translate
  
<2021-03-19 Fri>

** Discord
#+BEGIN_SRC shell
sudo snap install discord
#+END_SRC
+ Official Website: https://discord.com/
+ Snapcraft: https://snapcraft.io/discord

<2021-03-19 Fri>  

** Dotfiles
#+BEGIN_SRC shell
mkdir ~/.dotfiles &&\
git clone https://github.com/shdennlin/dotfiles.git ~/.dotfiles/. &&\
cd ~/.dotfiles &&\
bash install.sh &&\
#+END_SRC
+ GitHub: https://github.com/shdennlin/dotfiles

<2021-03-19 Fri>
  
** draw.io
#+BEGIN_SRC shell
sudo snap install drawio
#+END_SRC
+ GitHub: https://github.com/jgraph/drawio-desktop
+ Snapcraft: https://snapcraft.io/drawio

<2021-03-23 Tue>

** Emacs
An extensible, customizable, free/libre text editor — and more.
#+begin_src shell
sudo snap install emacs --classic
#+end_src

+ Official Website: https://www.gnu.org/software/emacs/
+ Snapcraft: https://snapcraft.io/emacs
+ GitHub: https://github.com/emacs-mirror/emacs

<2021-03-19 Fri>

*** Emacs GUI can't activation Fcitx input method
#+begin_center shell
echo "export LC_CTYPE=zh_TW.UTF-8" >> ~/.xprofile
#+end_center
+ Ref: [[https://blog.rex-tsou.com/2017/12/arch-linux%E7%92%B0%E5%A2%83%E8%A8%AD%E5%AE%9A%E8%88%87%E5%B8%B8%E7%94%A8%E5%A5%97%E4%BB%B6/][Arch Linux：環境設定與常用套件]]

<2021-03-21 Sun>

** extra-cmake-modules
#+BEGIN_SRC shell
cd ~/Downloads &&\
git clone https://github.com/KDE/extra-cmake-modules.git &&\
cd extra-cmake-modules &&\
mkdir build &&\
cd build &&\
cmake ..  &&\
make &&\
sudo make install
#+END_SRC
+ GitHub: [[https://github.com/KDE/extra-cmake-modules][KDE/extra-cmake-modules]] 

** fcitx & boshiamy
#+BEGIN_SRC shell
sudo apt-get install -y fcitx fcitx-table-boshiamy fcitx-chewing
#+END_SRC
+ Ref: [[https://thorasgard520.blogspot.com/2019/04/linux-ubuntu-fcitx.html][Linux Ubuntu 嘸蝦米輸入法的FCITX安裝]] 

<2021-03-19 Fri>  

** flatpak
#+BEGIN_SRC shell
sudo apt install -y flatpak
#+END_SRC
+ Ref: [[https://zh.wikipedia.org/wiki/Flatpak][flatpak]](wiki)

** font
#+BEGIN_SRC shell
cd ~/Downloads &&\
git clone https://github.com/shdennlin/linux-configuration.git &&\
cd ~/Downloads/linux-configuration/fonts &&\
bash install.sh
#+END_SRC
+ GitHub: [[https://github.com/shdennlin/linux-configuration][shdennlin/linux-configuration]] 

** FreeCAD
#+BEGIN_SRC shell
sudo apt install -y freecad
#+END_SRC

** FSearch
#+BEGIN_SRC shell
sudo add-apt-repository ppa:christian-boxdoerfer/fsearch-daily &&\
sudo apt-get update &&\
sudo apt install fsearch-trunk
#+END_SRC
+ GitHub: [[https://github.com/cboxdoerfer/fsearch][cboxdoerfer/fsearch]] 
  
** gdrive
#+BEGIN_SRC shell
cd ~/Downloads &&\
wget -O drive https://drive.google.com/uc?id=0B3X9GlR6Embnb095MGxEYmJhY2c &&\
sudo install drive /usr/local/bin/drive
#+END_SRC
+ GitHub: [[https://github.com/prasmussen/gdrive][prasmussen/gdrive]]  
+ Ref: [[https://hiraku.tw/2020/01/5894/][如何在終端機介面使用 Google Drive (gdrive cmd)]] 

** Git
Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency. 
#+BEGIN_SRC shell
sudo add-apt-repository ppa:git-core/ppa
sudo apt update
sudo apt-get -y install git
#+END_SRC
+ Official Website: https://git-scm.com/

<2021-03-20 Sat>

** GitKraken
#+BEGIN_SRC shell
wget https://release.gitkraken.com/linux/gitkraken-amd64.deb ~/Downloads &&\
sudo dpkg -i ~/Downloads/gitkraken-amd64.deb
#+END_SRC
+ Ref: [[https://www.gitkraken.com/][GitKrakon]] 

** GNOME

Install gnome extensions and web plugins
#+BEGIN_SRC shell
sudo apt install -y gnome-tweaks gnome-shell-extensions &&\
sudo apt install -y chrome-gnome-shell
gnome-shell --version
#+END_SRC

+ Ref: [[https://www.itread01.com/content/1544311459.html][針對Gnome 3的Linux桌面進行美化]] 
<2021-03-19 Fri>

