content/posts/linux/linux-install-application/linux-install-application.md
+++
title = "My Install Application in Linux"
author = ["Shawn Dennis Lin"]
date = 2021-03-16T00:00:00+08:00
lastmod = 2021-03-21T18:17:36+08:00
tags = ["linux"]
categories = ["OS"]
draft = false
hero = "/posts/linux/linux-install-application/images/linux.png"
[menu.sidebar]
  parent = "linux"
  weight = "auto"
  identifier = "linux-install-app"
  name = "Linux Install Application"
+++

These are the applications I installed in Linux. If you have any questions about these apps, you can contact me.  

<!--more-->


## My Install Application in Linux {#my-install-application-in-linux}


### ag {#ag}

A code searching tool similar to ack, with a focus on speed.  

```shell
sudo apt-get install -y silversearcher-ag
```

-   GitHub: <https://github.com/ggreer/the%5Fsilver%5Fsearcher>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-16 Tue&gt;</span></span>  


### Anaconda {#anaconda}

```shell
cd ~/Downloads
wget https://repo.anaconda.com/archive/Anaconda3-2020.02-Linux-x86_64.sh
bash ~/Dwonloads/Anaconda3-2020.02-Linux-x86_64.sh
conda create -n tf-gpu tensorflow-gpu
conda activate tf-gpu
```


### Angry IP scanner {#angry-ip-scanner}

Angry IP Scanner - fast and friendly network scanner  
**Go to Download Page to Download `deb` file** and type below:  

```shell
cd ~/Downloads
sudo apt install ipscan_3.7.6_all.deb # your version
```

-   Official Website: <https://angryip.org/about/>
-   Download Page: <https://angryip.org/download/#linux>
-   GitHub: <https://github.com/angryip/ipscan/tree/3.7.2>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>  


### BingWall - Bing wallpaper of the day {#bingwall-bing-wallpaper-of-the-day}

Bing wallpaper of the day application for Gnome desktop.  

```shell
sudo snap install bing-wall
```

-   Snapcraft: <https://snapcraft.io/bing-wall>
-   GitHub: <https://github.com/keshavbhatt/BingWall>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-16 Tue&gt;</span></span>  


### boot-repair {#boot-repair}

```shell
sudo add-apt-repository ppa:yannubuntu/boot-repair &&\
sudo apt-get update &&\
sudo apt-get install -y boot-repair && boot-repair
```

-   Ref: <https://help.ubuntu.com/community/Boot-Repair>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>  


### bpytop {#bpytop}

Resource monitor that shows usage and stats for processor, memory, disks, network and processes. Python port of bashtop.  

```shell
cd ~/Downloads &&\
git clone https://github.com/aristocratos/bpytop.git &&\
cd bpytop &&\
sudo make install
```

-   GitHub: <https://github.com/aristocratos/bpytop>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>  


### 中文 Language pack {#中文-language-pack}

```shell
echo $LANG

sudo apt-get install -y language-pack-zh-han* &&\
sudo apt install $(check-language-support)

sudo apt-get install language-pack-gnome-zh-han*
```

-   Ref: [Ubuntu 18.04 LTS 命令行方式安裝中文語言包](https://www.twblogs.net/a/5c38452dbd9eee35b21d8750)

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>  


### Crow Translate {#crow-translate}

A small translate tool like QTranslate.  

```shell
sudo add-apt-repository ppa:jonmagon/crow-translate &&\
sudo apt update &&\
sudo apt install crow-translate
```

-   Official Website: <https://crow-translate.github.io/>
-   GitHub: <https://github.com/crow-translate/crow-translate>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>  


### Discord {#discord}

```shell
sudo snap install discord
```

-   Official Website: <https://discord.com/>
-   Snapcraft: <https://snapcraft.io/discord>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;  </span></span>    


### Dotfiles {#dotfiles}

```shell
mkdir ~/.dotfiles &&\
git clone https://github.com/shdennlin/dotfiles.git ~/.dotfiles/. &&\
cd ~/.dotfiles &&\
bash install.sh &&\
```

-   GitHub: <https://github.com/shdennlin/dotfiles>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>  


### Emacs {#emacs}

An extensible, customizable, free/libre text editor — and more.  

```shell
sudo snap install emacs --classic
```

-   Official Website: <https://www.gnu.org/software/emacs/>
-   Snapcraft: <https://snapcraft.io/emacs>
-   GitHub: <https://github.com/emacs-mirror/emacs>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>  


#### Emacs GUI can't activation Fcitx input method {#emacs-gui-can-t-activation-fcitx-input-method}

<style>.org-center { margin-left: auto; margin-right: auto; text-align: center; }</style>

<div class="org-center">
  <div></div>

echo "export LC\_CTYPE=zh\_TW.UTF-8" >> ~/.xprofile  

</div>

-   Ref: [Arch Linux：環境設定與常用套件](https://blog.rex-tsou.com/2017/12/arch-linux%E7%92%B0%E5%A2%83%E8%A8%AD%E5%AE%9A%E8%88%87%E5%B8%B8%E7%94%A8%E5%A5%97%E4%BB%B6/)

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-21 Sun&gt;</span></span>  


### extra-cmake-modules {#extra-cmake-modules}

```shell
cd ~/Downloads &&\
git clone https://github.com/KDE/extra-cmake-modules.git &&\
cd extra-cmake-modules &&\
mkdir build &&\
cd build &&\
cmake ..  &&\
make &&\
sudo make install
```

-   GitHub: [KDE/extra-cmake-modules](https://github.com/KDE/extra-cmake-modules)


### fcitx & boshiamy {#fcitx-and-boshiamy}

```shell
sudo apt-get install -y fcitx fcitx-table-boshiamy fcitx-chewing
```

-   Ref: [Linux Ubuntu 嘸蝦米輸入法的FCITX安裝](https://thorasgard520.blogspot.com/2019/04/linux-ubuntu-fcitx.html)

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;  </span></span>    


### flatpak {#flatpak}

```shell
sudo apt install -y flatpak
```

-   Ref: [flatpak](https://zh.wikipedia.org/wiki/Flatpak)(wiki)


### font {#font}

```shell
cd ~/Downloads &&\
git clone https://github.com/shdennlin/linux-configuration.git &&\
cd ~/Downloads/linux-configuration/fonts &&\
bash install.sh
```

-   GitHub: [shdennlin/linux-configuration](https://github.com/shdennlin/linux-configuration)


### FreeCAD {#freecad}

```shell
sudo apt install -y freecad
```


### FSearch {#fsearch}

```shell
sudo add-apt-repository ppa:christian-boxdoerfer/fsearch-daily &&\
sudo apt-get update &&\
sudo apt install fsearch-trunk
```

-   GitHub: [cboxdoerfer/fsearch](https://github.com/cboxdoerfer/fsearch)


### gdrive {#gdrive}

```shell
cd ~/Downloads &&\
wget -O drive https://drive.google.com/uc?id=0B3X9GlR6Embnb095MGxEYmJhY2c &&\
sudo install drive /usr/local/bin/drive
```

-   GitHub: [prasmussen/gdrive](https://github.com/prasmussen/gdrive)
-   Ref: [如何在終端機介面使用 Google Drive (gdrive cmd)](https://hiraku.tw/2020/01/5894/)


### Git {#git}

Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency.  

```shell
sudo add-apt-repository ppa:git-core/ppa
sudo apt update
sudo apt-get -y install git
```

-   Official Website: <https://git-scm.com/>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-20 Sat&gt;</span></span>  


### GitKraken {#gitkraken}

```shell
wget https://release.gitkraken.com/linux/gitkraken-amd64.deb ~/Downloads &&\
sudo dpkg -i ~/Downloads/gitkraken-amd64.deb
```

-   Ref: [GitKrakon](https://www.gitkraken.com/)


### GNOME {#gnome}

Install gnome extensions and web plugins  

```shell
sudo apt install -y gnome-tweaks gnome-shell-extensions &&\
sudo apt install -y chrome-gnome-shell
gnome-shell --version
```

-   Ref: [針對Gnome 3的Linux桌面進行美化](https://www.itread01.com/content/1544311459.html)

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>  
