content/posts/linux/linux-install-application/.linux-install-application.org
*** My extensions
1. [[https://extensions.gnome.org/extension/16/auto-move-windows/][Auto Move Windows]]
2. [[https://extensions.gnome.org/extension/517/caffeine/][Caffeine]]
3. [[https://extensions.gnome.org/extension/307/dash-to-dock/][Dash to Dock]]
4. [[https://extensions.gnome.org/extension/1465/desktop-icons/][Desktop Icons]]
5. [[https://extensions.gnome.org/extension/545/hide-top-bar/][Hide Top Bar]]
6. [[https://extensions.gnome.org/extension/750/openweather/][OpenWeather]]
7. [[https://extensions.gnome.org/extension/800/remove-dropdown-arrows/][Remove Dropdown Arrows]]
8. [[https://extensions.gnome.org/extension/120/system-monitor/][system-monitor]]

** HUGO
A Fast and Flexible Static Site Generator built with love by bep, spf13 and friends in Go.
#+BEGIN_SRC shell
# sudo snap install hugo  # version 0.80.0, or
# sudo apt  install hugo  # version 0.68.3-1
sudo snap install hugo
#+END_SRC
+ Official Website: https://gohugo.io/
+ Install tutorial: [[https://gohugo.io/getting-started/installing]]
+ GitHub: [[https://github.com/gohugoio/hugo]]

<2021-03-16 Tue>

** Java
Preparation: Download jre-8u251-linux-x64.tar.gz
Download location: [[https://java.com/en/download/linux_manual.jsp][Java Downloads for Linux]] 
#+BEGIN_SRC shell
cd /usr &&\
sudo mkdir java &&\
cd java &&\
sudo mv ~/Downloads/jre-8u251-linux-x64.tar.gz . &&\
sudo tar zxvf jre-8u251-linux-x64.tar.gz &&\
sudo rm -rf jre-8u251-linux-x64.tar.gz
#+END_SRC
+ Preparation: Download jre-8u251-linux-x64.tar.gz
+ Ref: [[https://java.com/en/download/linux_manual.jsp][Java Downloads for Linux]]  

** KiCad
#+BEGIN_SRC shell
sudo add-apt-repository --yes ppa:js-reynaud/kicad-4 ; &&\
sudo apt-get update ; &&\
sudo apt-get install -y kicad
#+END_SRC
+ Ref: [[https://kicad.org/download/ubuntu/][KiCad Install on Ubuntu]]

** Latex
#+BEGIN_SRC shell
sudo apt-get install texlive-base &&\
sudo apt-get install texlive-latex-recommended &&\
sudo apt-get install texlive &&\
sudo apt-get install texlive-latex-extra &&\
sudo apt-get install texlive-xetex
#+END_SRC
+ Ref: [[https://linuxconfig.org/how-to-install-latex-on-ubuntu-20-04-focal-fossa-linux][How to install LaTex on Ubuntu 20.04 Focal Fossa Linux]] 

** LINE
+ Ref: [[https://tedliou.com/archives/howto-install-line-on-ubuntu-20-04/][如何在 Ubuntu 20.04 中安裝 LINE 通訊軟體]]

<2021-03-16 Tue>

** Linux Advanced Power Management (TLP)
TLP is a feature-rich command line utility for Linux, saving laptop battery power without the need to delve deeper into technical details.

TLP’s default settings are already optimized for battery life and implement Powertop’s recommendations out of the box. So you may just install and forget it.

Nevertheless TLP is highly customizable to fulfil your specific requirements.

#+BEGIN_SRC shell
sudo add-apt-repository ppa:linrunner/tlp &&\
sudo apt update &&\
sudo apt install tlp tlp-rdw &&\
sudo apt-get install smartmontools &&\
sudo systemctl start tlp &&\
sudo tlp-stat | less
#+END_SRC
+ Ref: [[https://github.com/twtrubiks/linux-note/tree/master/linux-tlp-tutorial][linux tlp tutorial]]
+ Ref: [[https://linrunner.de/tlp/][TLP - Optimize Linux Laptop Battery Life]] 

** linux-wifi-hotspot
Feature-rich wifi hotspot creator for Linux which provides both GUI and command-line interface. It is also able to create a hotspot using the same wifi card which is connected to an AP already ( Similar to Windows 10).
#+BEGIN_SRC shell
sudo add-apt-repository ppa:lakinduakash/lwh
sudo apt install linux-wifi-hotspot
#+END_SRC
+ GitHub: https://github.com/lakinduakash/linux-wifi-hotspot

<2021-03-19 Fri>

** lm Sensors
#+begin_src shell
sudo apt install -y lm-sensors

sudo sensors-detect

sensors
#+end_src

+ Ref: [[https://linoxide.com/install-lm-sensors-linux/][How to Install lm Sensors on Linux]]

<2021-03-18 Thu>

** locate
#+begin_src shell
sudo apt install -y mlocate
#+end_src

+ Ref: [[http://blog.faq-book.com/?p=1013][搜尋指令 which, whereis, locate, find的差別]]

<2021-03-19 Fri>

** Logitech MX Master
First:
#+BEGIN_SRC shell
sudo apt install -y cmake libevdev-dev libudev-dev libconfig++-dev &&\
mkdir -p ~/Downloads/logiops &&\
git clone https://github.com/PixlOne/logiops.git ~/Downloads/logiops/  &&\
cd ~/Downloads/logiops &&\
mkdir build &&\
cd build &&\
cmake .. &&\
make &&\
sudo make install &&\
sudo systemctl start logid
#+END_SRC
Second:
#+BEGIN_SRC shell
mkdir -p ~/Downloads/logitech-mouse-config &&\
git clone https://github.com/shdennlin/logitech-mouse-config.git ~/Downloads/logitech-mouse-config/ &&\
cd ~/Downloads/logitech-mouse-config/ &&\
bash install.sh
#+END_SRC
+ GitHub: [[https://github.com/shdennlin/logitech-mouse-config][shdennlin/logitech-mouse-config]]  
+ Ref: See GitHub

** MusixMatch
#+BEGIN_SRC shell
sudo snap install musixmatch
#+END_SRC
+ GitHub:   
+ Ref: [[https://snapcraft.io/musixmatch][Install Musixmatch on your Linux distribution]] 

** TODO NFS
#+begin_src shell
sudo apt install -y nfs-kernel-server nfs-common
#+end_src
show status
#+begin_src shell
systemctl status rpcbind.service
systemctl status 
#+end_src

<2021-03-18 Thu>

** NPM
#+begin_src shell
sudo apt install -y npm
sudo npm i -g npm

sudo npm install -g chokidar
sudo npm install -g urix
sudo npm install -g resolve-url


sudo npm install -g vmd

sudo npm audit fix
#+end_src

** nomacs
nomacs is a free, open source image viewer, which supports multiple platforms. You can use it for viewing all common image formats including RAW and psd images.
#+BEGIN_SRC shell
sudo apt install nomacs &&\
sudo apt-get install nomacs-l10n
#+END_SRC
+ Ref: [[https://nomacs.org/\\][nomacs.org]] 

** NVTOP
Nvtop stands for NVidia TOP, a (h)top like task monitor for NVIDIA GPUs. It can handle multiple GPUs and print information about them in a htop familiar way.
#+BEGIN_SRC shell
sudo apt install cmake libncurses5-dev libncursesw5-dev
sudo apt install -y nvtop
#+END_SRC
+ GitHub: https://github.com/Syllo/nvtop

<2021-03-18 Thu>

** Okular
Okular is a universal document viewer developed by KDE. Okular works on multiple platforms, including but not limited to Linux, Windows, macOS, *BSD, etc.
#+BEGIN_SRC shell
sudo apt-get install okular
#+END_SRC
+ Ref: [[https://okular.kde.org/][okular.kde.org]] 

** Open Broadcaster Software Studio (OBS)
Free and open source software for video recording and live streaming.
#+BEGIN_SRC shell
sudo add-apt-repository ppa:obsproject/obs-studio ;\
sudo apt update ;\
sudo apt install -y obs-studio
#+END_SRC
+ Ref1: [[https://obsproject.com/][obsproject.com]] 
+ Ref2: [[https://itsfoss.com/best-linux-screen-recorders/][9 Best Screen Recorders For Linux]]

** rar, zip
#+BEGIN_SRC shell
apt-get install -y unrar &&\
sudo apt install -y p7zip-full
#+END_SRC

** screenfetch
screenFetch is a "Bash Screenshot Information Tool". This handy Bash script can be used to generate one of those nifty terminal theme information + ASCII distribution logos you see in everyone's screenshots nowadays. It will auto-detect your distribution and display an ASCII version of that distribution's logo and some valuable information to the right. There are options to specify no ASCII art, colors, taking a screenshot upon displaying info, and even customizing the screenshot command! This script is very easy to add to and can easily be extended.
#+BEGIN_SRC shell
apt install screenfetch
#+END_SRC
+ GitHub:  [[https://github.com/KittyKatt/screenFetch][KittyKatt/screenFetch]] 

