content/posts/linux/linux-install-application/linux-install-application.md


#### My extensions {#my-extensions}

1.  [Auto Move Windows](https://extensions.gnome.org/extension/16/auto-move-windows/)
2.  [Caffeine](https://extensions.gnome.org/extension/517/caffeine/)
3.  [Dash to Dock](https://extensions.gnome.org/extension/307/dash-to-dock/)
4.  [Desktop Icons](https://extensions.gnome.org/extension/1465/desktop-icons/)
5.  [Hide Top Bar](https://extensions.gnome.org/extension/545/hide-top-bar/)
6.  [OpenWeather](https://extensions.gnome.org/extension/750/openweather/)
7.  [Remove Dropdown Arrows](https://extensions.gnome.org/extension/800/remove-dropdown-arrows/)
8.  [system-monitor](https://extensions.gnome.org/extension/120/system-monitor/)


### HUGO {#hugo}

A Fast and Flexible Static Site Generator built with love by bep, spf13 and friends in Go.  

```shell
# sudo snap install hugo  # version 0.80.0, or
# sudo apt  install hugo  # version 0.68.3-1
sudo snap install hugo
```

-   Official Website: <https://gohugo.io/>
-   Install tutorial: <https://gohugo.io/getting-started/installing>
-   GitHub: <https://github.com/gohugoio/hugo>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-16 Tue&gt;</span></span>  


### Java {#java}

Preparation: Download jre-8u251-linux-x64.tar.gz  
Download location: [Java Downloads for Linux](https://java.com/en/download/linux%5Fmanual.jsp)   

```shell
cd /usr &&\
sudo mkdir java &&\
cd java &&\
sudo mv ~/Downloads/jre-8u251-linux-x64.tar.gz . &&\
sudo tar zxvf jre-8u251-linux-x64.tar.gz &&\
sudo rm -rf jre-8u251-linux-x64.tar.gz
```

-   Preparation: Download jre-8u251-linux-x64.tar.gz
-   Ref: [Java Downloads for Linux](https://java.com/en/download/linux%5Fmanual.jsp)


### KiCad {#kicad}

```shell
sudo add-apt-repository --yes ppa:js-reynaud/kicad-4 ; &&\
sudo apt-get update ; &&\
sudo apt-get install -y kicad
```

-   Ref: [KiCad Install on Ubuntu](https://kicad.org/download/ubuntu/)


### Latex {#latex}

```shell
sudo apt-get install texlive-base &&\
sudo apt-get install texlive-latex-recommended &&\
sudo apt-get install texlive &&\
sudo apt-get install texlive-latex-extra &&\
sudo apt-get install texlive-xetex
```

-   Ref: [How to install LaTex on Ubuntu 20.04 Focal Fossa Linux](https://linuxconfig.org/how-to-install-latex-on-ubuntu-20-04-focal-fossa-linux)


### LINE {#line}

-   Ref: [如何在 Ubuntu 20.04 中安裝 LINE 通訊軟體](https://tedliou.com/archives/howto-install-line-on-ubuntu-20-04/)

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-16 Tue&gt;</span></span>  


### Linux Advanced Power Management (TLP) {#linux-advanced-power-management--tlp}

TLP is a feature-rich command line utility for Linux, saving laptop battery power without the need to delve deeper into technical details.  

TLP’s default settings are already optimized for battery life and implement Powertop’s recommendations out of the box. So you may just install and forget it.  

Nevertheless TLP is highly customizable to fulfil your specific requirements.  

```shell
sudo add-apt-repository ppa:linrunner/tlp &&\
sudo apt update &&\
sudo apt install tlp tlp-rdw &&\
sudo apt-get install smartmontools &&\
sudo systemctl start tlp &&\
sudo tlp-stat | less
```

-   Ref: [linux tlp tutorial](https://github.com/twtrubiks/linux-note/tree/master/linux-tlp-tutorial)
-   Ref: [TLP - Optimize Linux Laptop Battery Life](https://linrunner.de/tlp/)


### linux-wifi-hotspot {#linux-wifi-hotspot}

Feature-rich wifi hotspot creator for Linux which provides both GUI and command-line interface. It is also able to create a hotspot using the same wifi card which is connected to an AP already ( Similar to Windows 10).  

```shell
sudo add-apt-repository ppa:lakinduakash/lwh
sudo apt install linux-wifi-hotspot
```

-   GitHub: <https://github.com/lakinduakash/linux-wifi-hotspot>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>  


### lm Sensors {#lm-sensors}

```shell
sudo apt install -y lm-sensors

sudo sensors-detect

sensors
```

-   Ref: [How to Install lm Sensors on Linux](https://linoxide.com/install-lm-sensors-linux/)

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-18 Thu&gt;</span></span>  


### locate {#locate}

```shell
sudo apt install -y mlocate
```

-   Ref: [搜尋指令 which, whereis, locate, find的差別](http://blog.faq-book.com/?p=1013)

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>  


### Logitech MX Master {#logitech-mx-master}

First:  

```shell
sudo apt install -y cmake libevdev-dev libudev-dev libconfig++-dev &&\
mkdir -p ~/Downloads/logiops &&\
git clone https://github.com/PixlOne/logiops.git ~/Downloads/logiops/  &&\
cd ~/Downloads/logiops &&\
mkdir build &&\
cd build &&\
cmake .. &&\
make &&\
sudo make install &&\
sudo systemctl start logid
```

Second:  

```shell
mkdir -p ~/Downloads/logitech-mouse-config &&\
git clone https://github.com/shdennlin/logitech-mouse-config.git ~/Downloads/logitech-mouse-config/ &&\
cd ~/Downloads/logitech-mouse-config/ &&\
bash install.sh
```

-   GitHub: [shdennlin/logitech-mouse-config](https://github.com/shdennlin/logitech-mouse-config)
-   Ref: See GitHub


### MusixMatch {#musixmatch}

```shell
sudo snap install musixmatch
```

-   GitHub:
-   Ref: [Install Musixmatch on your Linux distribution](https://snapcraft.io/musixmatch)


### <span class="org-todo todo TODO">TODO</span> NFS {#nfs}

```shell
sudo apt install -y nfs-kernel-server nfs-common
```

show status  

```shell
systemctl status rpcbind.service
systemctl status 
```

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-18 Thu&gt;</span></span>  


### nomacs {#nomacs}

nomacs is a free, open source image viewer, which supports multiple platforms. You can use it for viewing all common image formats including RAW and psd images.  

```shell
sudo apt install nomacs &&\
sudo apt-get install nomacs-l10n
```

-   Ref: [nomacs.org](https://nomacs.org/%5C)


### NVTOP {#nvtop}

Nvtop stands for NVidia TOP, a (h)top like task monitor for NVIDIA GPUs. It can handle multiple GPUs and print information about them in a htop familiar way.  

```shell
sudo apt install cmake libncurses5-dev libncursesw5-dev
sudo apt install -y nvtop
```

-   GitHub: <https://github.com/Syllo/nvtop>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-18 Thu&gt;</span></span>  


### Okular {#okular}

Okular is a universal document viewer developed by KDE. Okular works on multiple platforms, including but not limited to Linux, Windows, macOS, \*BSD, etc.  

```shell
sudo apt-get install okular
```

-   Ref: [okular.kde.org](https://okular.kde.org/)


### Open Broadcaster Software Studio (OBS) {#open-broadcaster-software-studio--obs}

Free and open source software for video recording and live streaming.  

```shell
sudo add-apt-repository ppa:obsproject/obs-studio ;\
sudo apt update ;\
sudo apt install -y obs-studio
```

-   Ref1: [obsproject.com](https://obsproject.com/)
-   Ref2: [9 Best Screen Recorders For Linux](https://itsfoss.com/best-linux-screen-recorders/)


### rar, zip {#rar-zip}

```shell
apt-get install -y unrar &&\
sudo apt install -y p7zip-full
```


### screenfetch {#screenfetch}

screenFetch is a "Bash Screenshot Information Tool". This handy Bash script can be used to generate one of those nifty terminal theme information + ASCII distribution logos you see in everyone's screenshots nowadays. It will auto-detect your distribution and display an ASCII version of that distribution's logo and some valuable information to the right. There are options to specify no ASCII art, colors, taking a screenshot upon displaying info, and even customizing the screenshot command! This script is very easy to add to and can easily be extended.  

```shell
apt install screenfetch
```

-   GitHub:  [KittyKatt/screenFetch](https://github.com/KittyKatt/screenFetch)
