content/posts/linux/linux-install-application/.linux-install-application.org
** Spacemacs
Spacemacs is a new way to experience Emacs -- a sophisticated and polished set-up focused on ergonomics, mnemonics and consistency.

Just clone it, launch it, then press the space bar to explore the interactive list of carefully-chosen key bindings. You can also press the home buffer's [?] button for some great first key bindings to try.

Spacemacs can be used naturally by both Emacs and Vim users -- you can even mix the two editing styles. Switching easily between input styles makes Spacemacs a great tool for pair-programming.

Spacemacs is currently in beta, and contributions are very welcome.
#+BEGIN_SRC shell
git clone https://github.com/syl20bnr/spacemacs.git ~/.emacs.d &&\
git clone https://github.com/shdennlin/spacemacs-private.git ~/.spacemacs.d
#+END_SRC
+ GitHub1: [[https://github.com/syl20bnr/spacemacs][syl20bnr/spacemacs]] 
+ GitHub2: [[https://github.com/shdennlin/spacemacs-private][shdennlin/spacemacs-private]] 
+ Ref: [[https://www.spacemacs.org/][spacemacs.org]]  

<2021-03-19 Fri>

** Spotify
#+BEGIN_SRC shell
sudo snap install spotify
#+END_SRC

+ Official Website: https://www.spotify.com/
+ Snapcraft: https://snapcraft.io/spotify

<2021-03-19 Fri> 
  
** systemback
#+begin_src shell
sudo apt install systemback
#+end_src

+ Install tutorial: https://ubuntuqa.com/zh-tw/article/10012.html
+ Install tutorial: https://www.linuxbabe.com/ubuntu/install-systemback-ubuntu-18-04-bionic-18-10

<2021-03-18 Thu>

** Tensorflow-gpu
#+BEGIN_SRC shell
cd ~/Downloads
wget http://tw.download.nvidia.com/XFree86/Linux-x86_64/440.82/NVIDIA-Linux-x86_64-440.82.run
#+END_SRC
+ Ref: [[https://illya13.github.io/RL/tutorial/2020/04/26/installing-tensorflow-on-ubuntu-20.html][Installing TensorFlow 2 with GPU support on Ubuntu 20.04 LTS]] 

** Terminator
Originally created and developed for a long time by Chris Jones, the goal of this project is to produce a useful tool for arranging terminals. It is inspired by programs such as gnome-multi-term, quadkonsole, etc. in that the main focus is arranging terminals in grids (tabs is the most common default method, which Terminator also supports).

Much of the behaviour of Terminator is based on GNOME Terminal, and we are adding more features from that as time goes by, but we also want to extend out in different directions with useful features for sysadmins and other users. If you have any suggestions, please file wishlist bugs! (see below for the address)
#+BEGIN_SRC shell
sudo apt install -y terminator
#+END_SRC

+ Official Website: https://gnometerminator.blogspot.com/
+ Install tutorial: https://gnometerminator.blogspot.com/p/introduction.html
+ My configuration: https://github.com/shdennlin/dotfiles

<2021-03-16 Tue>

** typora
Typora gives you a seamless experience as both a reader and a writer. It removes the preview window, mode switcher, syntax symbols of markdown source code, and all other unnecessary distractions. Instead, it provides a real live preview feature to help you concentrate on the content itself.

#+begin_src shell
# or run:
# sudo apt-key adv --keyserver keyserver.ubuntu.com --recv-keys BA300B7755AFCFAE

wget -qO - https://typora.io/linux/public-key.asc | sudo apt-key add -

# add Typora's repository

sudo add-apt-repository 'deb https://typora.io/linux ./'

sudo apt-get update

# install typora

sudo apt-get install typora
#+end_src

+ Official Website: https://typora.io/

<2021-03-24 Wed>

** update & upgrade  
#+BEGIN_SRC shell
sudo apt-get update && sudo apt-get -y upgrade
#+END_SRC
or
#+BEGIN_SRC shell
sudo apt-get update && sudo apt-get -y dist-upgrade
#+END_SRC

+ Ref: [[https://blog.longwin.com.tw/2008/03/debian_ubuntu_apt_dist_upgrade_difference_2008/][APT upgrade 和 dist-upgrade 的差別]] 
    
** Vim
#+BEGIN_SRC shell
sudo apt purge vim
sudo apt-get install vim-gtk3
git clone https://github.com/VundleVim/Vundle.vim.git ~/.vim/bundle/Vundle.vim
#+END_SRC
+ Ref: [[https://github.com/shdennlin/dotfiles][shdennlin/dotfiles]] 

** Wine
Wine (originally an acronym for "Wine Is Not an Emulator") is a compatibility layer capable of running Windows applications on several POSIX-compliant operating systems, such as Linux, macOS, & BSD. Instead of simulating internal Windows logic like a virtual machine or emulator, Wine translates Windows API calls into POSIX calls on-the-fly, eliminating the performance and memory penalties of other methods and allowing you to cleanly integrate Windows applications into your desktop.
+ Ref: [[https://wiki.winehq.org/Download][Supported Wine]] 
+ Ref: [[https://wiki.winehq.org][winehq.org]] 

** xclip
xclip is a command line interface to the X11 clipboard. It allows you to put the output of a command directly into the clipboard so that you don't have to copy&paste from the terminal manually (which can be a tedious task especially if the output is very long). It also allows you to put the contents of a file directly into the clipboard. 
#+BEGIN_SRC shell
sudo apt-get install -y xclip
#+END_SRC
+ Ref: [[https://www.howtoforge.com/command-line-copy-and-paste-with-xclip-debian-ubuntu][Command-Line Copy&Paste With xclip (Debian/Ubuntu)]]

** System Problem
