content/posts/linux/linux-install-application/linux-install-application.md


### Spacemacs {#spacemacs}

Spacemacs is a new way to experience Emacs -- a sophisticated and polished set-up focused on ergonomics, mnemonics and consistency.  

Just clone it, launch it, then press the space bar to explore the interactive list of carefully-chosen key bindings. You can also press the home buffer's [?] button for some great first key bindings to try.  

Spacemacs can be used naturally by both Emacs and Vim users -- you can even mix the two editing styles. Switching easily between input styles makes Spacemacs a great tool for pair-programming.  

Spacemacs is currently in beta, and contributions are very welcome.  

```shell
git clone https://github.com/syl20bnr/spacemacs.git ~/.emacs.d &&\
git clone https://github.com/shdennlin/spacemacs-private.git ~/.spacemacs.d
```

-   GitHub1: [syl20bnr/spacemacs](https://github.com/syl20bnr/spacemacs)
-   GitHub2: [shdennlin/spacemacs-private](https://github.com/shdennlin/spacemacs-private)
-   Ref: [spacemacs.org](https://www.spacemacs.org/)

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt;</span></span>  


### Spotify {#spotify}

```shell
sudo snap install spotify
```

-   Official Website: <https://www.spotify.com/>
-   Snapcraft: <https://snapcraft.io/spotify>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-19 Fri&gt; </span></span>   


### systemback {#systemback}

```shell
sudo apt install systemback
```

-   Install tutorial: <https://ubuntuqa.com/zh-tw/article/10012.html>
-   Install tutorial: <https://www.linuxbabe.com/ubuntu/install-systemback-ubuntu-18-04-bionic-18-10>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-18 Thu&gt;</span></span>  


### Tensorflow-gpu {#tensorflow-gpu}

```shell
cd ~/Downloads
wget http://tw.download.nvidia.com/XFree86/Linux-x86_64/440.82/NVIDIA-Linux-x86_64-440.82.run
```

-   Ref: [Installing TensorFlow 2 with GPU support on Ubuntu 20.04 LTS](https://illya13.github.io/RL/tutorial/2020/04/26/installing-tensorflow-on-ubuntu-20.html)


### Terminator {#terminator}

Originally created and developed for a long time by Chris Jones, the goal of this project is to produce a useful tool for arranging terminals. It is inspired by programs such as gnome-multi-term, quadkonsole, etc. in that the main focus is arranging terminals in grids (tabs is the most common default method, which Terminator also supports).  

Much of the behaviour of Terminator is based on GNOME Terminal, and we are adding more features from that as time goes by, but we also want to extend out in different directions with useful features for sysadmins and other users. If you have any suggestions, please file wishlist bugs! (see below for the address)  

```shell
sudo apt install -y terminator
```

-   Official Website: <https://gnometerminator.blogspot.com/>
-   Install tutorial: <https://gnometerminator.blogspot.com/p/introduction.html>
-   My configuration: <https://github.com/shdennlin/dotfiles>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-16 Tue&gt;</span></span>  


### update & upgrade {#update-and-upgrade}

```shell
sudo apt-get update && sudo apt-get -y upgrade
```

or  

```shell
sudo apt-get update && sudo apt-get -y dist-upgrade
```

-   Ref: [APT upgrade 和 dist-upgrade 的差別](https://blog.longwin.com.tw/2008/03/debian%5Fubuntu%5Fapt%5Fdist%5Fupgrade%5Fdifference%5F2008/)


### Vim {#vim}

```shell
sudo apt purge vim
sudo apt-get install vim-gtk3
git clone https://github.com/VundleVim/Vundle.vim.git ~/.vim/bundle/Vundle.vim
```

-   Ref: [shdennlin/dotfiles](https://github.com/shdennlin/dotfiles)


### Wine {#wine}

Wine (originally an acronym for "Wine Is Not an Emulator") is a compatibility layer capable of running Windows applications on several POSIX-compliant operating systems, such as Linux, macOS, & BSD. Instead of simulating internal Windows logic like a virtual machine or emulator, Wine translates Windows API calls into POSIX calls on-the-fly, eliminating the performance and memory penalties of other methods and allowing you to cleanly integrate Windows applications into your desktop.  

-   Ref: [Supported Wine](https://wiki.winehq.org/Download)
-   Ref: [winehq.org](https://wiki.winehq.org)


### xclip {#xclip}

xclip is a command line interface to the X11 clipboard. It allows you to put the output of a command directly into the clipboard so that you don't have to copy&paste from the terminal manually (which can be a tedious task especially if the output is very long). It also allows you to put the contents of a file directly into the clipboard.  

```shell
sudo apt-get install -y xclip
```

-   Ref: [Command-Line Copy&Paste With xclip (Debian/Ubuntu)](https://www.howtoforge.com/command-line-copy-and-paste-with-xclip-debian-ubuntu)
