content/posts/linux/linux-install-application/linux-install-application.md


### System Problem {#system-problem}


#### OS Information {#os-information}

`cat /etc/os-release`  

```shell
NAME="Ubuntu"
VERSION="20.04.2 LTS (Focal Fossa)"
ID=ubuntu
ID_LIKE=debian
PRETTY_NAME="Ubuntu 20.04.2 LTS"
VERSION_ID="20.04"
HOME_URL="https://www.ubuntu.com/"
SUPPORT_URL="https://help.ubuntu.com/"
BUG_REPORT_URL="https://bugs.launchpad.net/ubuntu/"
PRIVACY_POLICY_URL="https://www.ubuntu.com/legal/terms-and-policies/privacy-policy"
VERSION_CODENAME=focal
UBUNTU_CODENAME=focal
```

`lshw -class display`  

```shell
*-display                 
      description: VGA compatible controller
      product: GP107M [GeForce GTX 1050 3 GB Max-Q]
      vendor: NVIDIA Corporation
      physical id: 0
      bus info: pci@0000:01:00.0
      version: a1
      width: 64 bits
      clock: 33MHz
      configuration: driver=nvidia latency=0
      resources: irq:138 memory:a3000000-a3ffffff memory:90000000-9fffffff memory:a0000000-a1ffffff ioport:4000(size=128) memory:a4080000-a40fffff

*-display
      description: VGA compatible controller
      product: UHD Graphics 630 (Mobile)
      vendor: Intel Corporation
      physical id: 2
      bus info: pci@0000:00:02.0
      version: 00
      width: 64 bits
      clock: 33MHz
      capabilities: pciexpress msi pm vga_controller bus_master cap_list rom
      configuration: driver=i915 latency=0
      resources: irq:137 memory:a2000000-a2ffffff memory:b0000000-bfffffff ioport:5000(size=64) memory:c0000-dffff
```

`nvidia-smi`  

```shell
+-----------------------------------------------------------------------------+
| NVIDIA-SMI 460.67       Driver Version: 460.67       CUDA Version: 11.2     |
|-------------------------------|----------------------|----------------------+
| GPU  Name        Persistence-M| Bus-Id        Disp.A | Volatile Uncorr. ECC |
| Fan  Temp  Perf  Pwr:Usage/Cap|         Memory-Usage | GPU-Util  Compute M. |
|                               |                      |               MIG M. |
|===============================+======================+======================|
|   0  GeForce GTX 1050    Off  | 00000000:01:00.0  On |                  N/A |
| N/A   43C    P0    N/A /  N/A |    335MiB /  3020MiB |      0%      Default |
|                               |                      |                  N/A |
+-------------------------------|----------------------|----------------------+

+-----------------------------------------------------------------------------+
| Processes:                                                                  |
|  GPU   GI   CI        PID   Type   Process name                  GPU Memory |
|        ID   ID                                                   Usage      |
|=============================================================================|
|    0   N/A  N/A      1752      G   /usr/lib/xorg/Xorg                 57MiB |
|    0   N/A  N/A      2432      G   /usr/lib/xorg/Xorg                196MiB |
|    0   N/A  N/A      2629      G   /usr/bin/gnome-shell               70MiB |
+-----------------------------------------------------------------------------+
```

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-20 Sat&gt;</span></span>  


#### Doesn't auto enable Bluetooth when system startup. {#doesn-t-auto-enable-bluetooth-when-system-startup-dot}

18.04\* users who don't naturally have a /etc/rc.local, you'll need to create one and make it executable. To make things slightly easier, you can just paste the following command into a terminal:  

```shell
sudo install -b -m 755 /dev/stdin /etc/rc.local << EOF
#!/bin/sh
rfkill unblock bluetooth
exit 0
EOF
```

-   Ref Website: <https://askubuntu.com/a/2568/1193335>

<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-18 Thu&gt;</span></span>  


#### System doesn't resume after suspend {#system-doesn-t-resume-after-suspend}

[ `V` ] means it's work for me  
[ `X` ] means it's not work for me  
<span class="timestamp-wrapper"><span class="timestamp">&lt;2021-03-20 Sat&gt;</span></span>  

<!--list-separator-->

-  [ `X` ] Suspend and hibernate configuration in Debian Jessie

    1.  edit `/etc/systemd/logind.conf`
    2.  create the file `/etc/systemd/system/suspend-sedation.service`
    
    Ref: <https://wiki.debian.org/Hibernation>  
    Ref: <https://wiki.debian.org/SystemdSuspendSedation>  

<!--list-separator-->

-  [ `X` ] Hibernate with hibernate command

    ```shell
    sudo apt-get install hibernate
    sudo hibernate
    ```

<!--list-separator-->

-  [ `X` ] edit `/etc/systemd/logind.conf`

    Ref: <https://askubuntu.com/a/1245763/1193335>  

<!--list-separator-->

-  [ `X` ] edit `/etc/default/grub` file

    ```shell
    GRUB_CMDLINE_LINUX="nouveau.modeset=0"
    ```
    
    after that run:  
    
    ```shell
    sudo update-grub
    sudo reboot
    ```
    
    Ref: <https://askubuntu.com/a/1041395/1193335>  

<!--list-separator-->

-  [ `X` ] sudo apt-get install pm-utils

    I got a workaround for suspend working on Ubuntu 18.04 with a NVIDIA  
    GeForce GTX 1050 Mobile and proprietary nvidia drivers 390. I installed  
    pm-suspend via `sudo apt-get install pm-utils`. Then, I switch from  
    Gnome Shell to the terminal via Ctrl+Alt+f6. After the login, I do  
    `sudo pm-suspend`. After waking up from standby, I change back to Gnome  
    Shell via Ctrl+Alt+f1. Done!  
    
    Ref: <https://askubuntu.com/a/1081639/1193335>  

<!--list-separator-->

-  [ `V` ] add-apt-repository ppa:graphics-drivers/ppa

    ```shell
    sudo add-apt-repository ppa:graphics-drivers/ppa
    sudo apt update
    sudo apt upgrade
    sudo reboot
    ```
    
    Ref: <https://bugs.launchpad.net/ubuntu/+source/nvidia-graphics-drivers-460/+bug/1911055> #9  

<!--list-separator-->

-  [ `not test` ] edit `/etc/gdm3/custom.conf`

    If your desktop does not load after installing the corresponding driver, then do the following:  
    `sudo nano /etc/gdm3/custom.conf`  
    then remove the comment (# symbol) from the line that says  
    `# WaylandEnable=false`  
    and save. Then reboot. If this still does not work, then please disable Secure Boot since you might actually be using UEFI.  
    
    Ref: <https://askubuntu.com/a/61433/1193335> 1. The quick way  


#### Change the login screen resolution in Ubuntu 20.04 {#change-the-login-screen-resolution-in-ubuntu-20-dot-04}

<!--list-separator-->

-  [ `X` ] edit `/etc/default/grub` file

    Step:  
    
    1.  Open a terminal and enter:  
        
        ```shell
        sudo vi /etc/default/grub
        ```
    2.  Find the `#GRUB_GFXMODE=640x480`, Below that line, enter the following, substituting the 1920x1080 for a supported resolution:  
        
        ```shell
        GRUB_GFXMODE=1920x1080
        GRUB_GFXPAYLOAD_LINUX=keep
        ```
    
    Ref: <https://askubuntu.com/a/1041697/1193335>  

<!--list-separator-->

-  [ `V` ] edit `/etc/default/grub` file

    Just want to add that I found a way to change the login screen resolution. That part of my problem has been asked and answered, see [how to change gdm3 thread](https://askubuntu.com/questions/912052/how-do-i-change-gdm3-login-screen-resolution).  
    
    After setting up the monitor resolution and zoom level I wanted, I simply copy the settings to gdm3 .config directory, make any further changes you need and then reboot the PC.  
    
    ```shell
    sudo cp -i ~/.config/monitors.xml /var/lib/gdm3/.config/
    less /var/lib/gdm3/.config/monitors.xml
    ```
    
    You probably also need to do the following before rebooting. Select gdm3 when prompted.  
    
    ```shell
    sudo dpkg-reconfigure gdm3
    ```
    
    Ref: <https://askubuntu.com/a/1041697/1193335>  


#### <span class="org-todo todo TODO">TODO</span> Changing login background automatically {#changing-login-background-automatically}

Ref: <https://askubuntu.com/questions/1227070/how-do-i-change-login-screen-theme-or-background-in-ubuntu-20-04>
